Revit 2027 API
BuiltInFailures.SketchFailures.InvalidSketchForBuildingpad Property
 Pad sketch is invalid.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId InvalidSketchForBuildingpad { get; }
Public Shared ReadOnly Property InvalidSketchForBuildingpad As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ InvalidSketchForBuildingpad {
	FailureDefinitionId^ get ();
}
static member InvalidSketchForBuildingpad : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.SketchFailures Class
Autodesk.Revit.DB Namespace